---
kind: method
id: M:Autodesk.Revit.DB.Element.CanBeLocked
zh: 构件、图元、元素
source: html/5ef8834b-168d-02ac-2f29-5d43f5da87f2.htm
---
# Autodesk.Revit.DB.Element.CanBeLocked Method

**中文**: 构件、图元、元素

Identifies if the element can be locked.

## Syntax (C#)
```csharp
public bool CanBeLocked()
```

## Returns
True if the element can be locked, false otherwise.